* example of data we need to insert

#+begin_src sql :engine postgresql :dbhost localhost :dbport 5432 :database pyregence :dbuser pyregence :dbpassword pyregence
select * from organization_layers limit 1;
#+end_src

#+RESULTS:
| org_layer_uid | organization_rid | layer_path                                     | layer_config                                                                                                         |
|---------------+------------------+------------------------------------------------+----------------------------------------------------------------------------------------------------------------------|
|            24 |                3 | [:fire-weather :params :model :options :ecmwf] | {:opt-label "Euro", :filter "ecmwf", :geoserver-key :psps, :disabled-for #{:hdw :apcptot :apcp01 :vpd :smoke :tcdc}} |

* TODO 1 insert this data

#+begin_src clojure
[:fire-weather :params :model :options :nfdrs-constant]
{:opt-label "NFDRS Constant", :filter "nfdrs-constant", :geoserver-key :psps,
:disabled-for #{:hdw :apcptot :apcp01 :vpd :smoke :tcdc  :rh :tmpf :ffwi :meq :pign :wd :ws :wg}

{:opt-label "NFDRS Variable", :filter "nfdrs-variable", :geoserver-key :psps,
:disabled-for #{:hdw :apcptot :apcp01 :vpd :smoke :tcdc  :rh :tmpf :ffwi :meq :pign :wd :ws :wg}
#+end_src clojure


* TODO 2 update config.cljs with new params

;; <key/filter>: <opt-label>  (<unit>)
;; erc:   energy release component (ERC, Btu/sq ft)
;; ercperc:  ERC percentile
;; bi:  burning index (BI, ft * 10)
;; biperc:  BI percentile
;; sc: spread component (ft/min)
;; scperc: SC percentile
;; ic: ignition component (%)
;; sfdiperc: SFDI percentile
;; sfdicat: SFDI category (1=low, 2=moderate, 3=high, 4=very high, 5=severe)
;; lh:  Live herbaceous fuel moisture (% or fraction)
;; lw:  Live woody fuel moisture (% or fraction)
;; m1: 1-hour fuel moisture (% or fraction)
;; m10:  10-hour fuel moisture (% or fraction)
;; m100:  100-hour fuel moisture (% or fraction)
;; m1000: 1000-hour fuel moisture (% or fraction)
;; kbdiI: Keetch Byram Drought Index (0-800)
